{
  "landingPage": {
    "title": "Seu radar pessoal de projetos open-source",
    "subtitle": "Encontre projetos que combinam com suas habilidades, acompanhe suas contribuições e construa seu perfil de desenvolvedor na comunidade open source.",
    "loginInButton": "Entrar com Github",
    "exploreButton": "Explorar projetos",
    "learnButton": "Aprenda mais",
    "disclaimer": "Conecte-se com o GitHub para desbloquear recursos personalizados.",
    "bulletText": "Descobrir • Contribuir • Crescer",
    "radarTitle": "Radar de Projetos",
    "radarFooter": "Os projetos exibidos são populares na comunidade open-source.",
    "searchTitle": "Descubra projetos open source que correspondem aos seus interesses e nível de habilidade",
    "searchPlaceholder": "Pesquisar repositórios..."
  },
  "navbar": {
    "explore": "Explorar",
    "learn": "Aprender",
    "support": "Suporte",
    "exitMobileButton": "Sair"
  },
  "footer": {
    "mainText": "Descubra, contribua e evolua com projetos open source que combinam com suas habilidades e interesses.",
    "navigation": "Navegação",
    "resources": "Recursos",
    "firstSteps": "Primeiros Passos no GitHub",
    "openSourceGuide": "Guia open source",
    "privacyPolicy": "Política de privacidade",
    "termsOfService": "Termos de serviço",
    "initialPage": "Página inicial"
  },
  "learns": {
    "title": "Aprenda sobre Open Source",
    "subtitle": "Descubra como contribuir para projetos open source e ampliar seu potencial como desenvolvedor",
    "text1": "O que é Open Source?",
    "text2": "Entenda os conceitos básicos do universo open source",
    "text3": "Software open source é um tipo de software cujo código fonte é disponibilizado publicamente, permitindo que qualquer pessoa visualize, utilize, modifique e distribua o código conforme suas necessidades.",
    "text4": "Essa abordagem colaborativa possibilita que desenvolvedores de todo o mundo trabalhem juntos, compartilhem conhecimento e criem soluções melhores através da transparência e cooperação.",
    "text5": "Como Contribuir",
    "text6": "Primeiros passos para contribuir em projetos",
    "text7": "Encontre um projeto que se alinhe com seus interesses e habilidades",
    "text8": "Leia a documentação e guias de contribuição do projeto",
    "text9": "Explore issues marcadas como 'good first issue' ou 'beginner friendly'",
    "text10": "Faça um fork do repositório e clone-o localmente",
    "text11": "Crie uma branch para sua contribuição",
    "text12": "Desenvolva sua solução e teste-a",
    "text13": "Envie um pull request com suas mudanças",
    "text14": "Benefícios de Contribuir",
    "text15": "Por que participar da comunidade open source?",
    "text16": "Portfólio:",
    "text17": "Demonstre suas habilidades através de contribuições reais",
    "text18": "Networking:",
    "text19": "Conecte-se com desenvolvedores do mundo todo",
    "text20": "Aprendizado:",
    "text21": "Aprenda práticas de código de projetos estabelecidos",
    "text22": "Visibilidade:",
    "text23": "Ganhe reconhecimento na comunidade técnica",
    "text24": "Oportunidades:",
    "text25": "Encontre possibilidades de trabalho remoto global",
    "text26": "Comunidade Global",
    "text27": "Faça parte de uma comunidade sem fronteiras",
    "text28": "Contribuir para projetos open source é uma forma de ultrapassar barreiras geográficas e conectar-se com desenvolvedores do mundo todo. É uma oportunidade de colaborar em projetos significativos e construir relacionamentos profissionais internacionais.",
    "text29": "Através dessa experiência, você pode expandir sua rede de contatos, aprimorar habilidades de comunicação em inglês e aumentar suas chances de conquistar oportunidades de trabalho remoto global."
  },
  "explore": {
    "text1": "Descubra projetos open source que combinam com seus interesses e nível de habilidade",
    "text2": "Recomendados",
    "text3": "Favoritos",
    "text4": "Erro ao carregar repositórios",
    "text5": "Atingimos o limite de requisições da API do GitHub. Por favor, tente novamente em alguns minutos.",
    "text6": "Tentar Novamente",
    "text7": "Nenhum repositório encontrado",
    "text8": "Tente ajustar seus filtros ou usar termos de busca diferentes.",
    "text9": "Limpar filtros e tentar novamente",
    "text10": "Nenhum repositório favorito",
    "text11": "Você ainda não adicionou nenhum repositório aos seus favoritos."
  },
  "filterExplore": {
    "text1": "Buscar repositórios...",
    "text2": "Limpar Filtros",
    "text3": "Aplicar Filtros"
  },
  "pagination": {
    "previous": "Anterior",
    "next": "Próximo",
    "more": "Mais páginas"
  },
  "dashboard": {
    "text1": "Menos de 1 ano",
    "text2": "1-3 anos",
    "text3": "3-5 anos",
    "text4": "5+ anos",
    "text5": "Por favor, selecione pelo menos uma linguagem de programação",
    "text6": "Por favor, selecione seu tempo de experiência",
    "text7": "Perfil atualizado com sucesso",
    "text8": "Erro ao atualizar o perfil",
    "text9": "Carregando perfil...",
    "text10": "Seu Perfil",
    "text11": "Gerencie suas preferências e configurações",
    "text12": "Informações Pessoais",
    "text13": "Nível de Experiência",
    "text14": "Linguagens Preferidas",
    "text15": "Explorar Projetos",
    "text16": "Logout realizado com sucesso",
    "text17": "Erro ao fazer logout",
    "text18": "Sair da Conta",
    "text19": "Configurações do Perfil",
    "text20": "Linguagens de Programação Preferidas",
    "text21": "Nível de Experiência",
    "text22": "Salvando...",
    "text23": "Salvar Alterações",
    "text24": "Usuário",
    "text25": "Selecione linguagens..."
  },
  "suport": {
    "text1": "Apoie nossa missão",
    "text2": "Ajude-nos a capacitar desenvolvedores para contribuir com o open source e construir uma comunidade mais forte.",
    "text3": "Me pague um café",
    "text4": "Por que nos apoiar?",
    "text5": "Impulsione o desenvolvimento",
    "text6": "Seu apoio nos ajuda a manter servidores e desenvolver novos recursos para a plataforma.",
    "text7": "Apoie a educação",
    "text8": "Ajude-nos a criar mais conteúdos educacionais para guiar novos contribuintes no open source.",
    "text9": "Garanta a sustentabilidade",
    "text10": "Suas doações ajudam a garantir a sustentabilidade a longo prazo deste recurso comunitário gratuito.",
    "text11": "Outras formas de ajudar",
    "text12": "O apoio financeiro não é a única maneira de contribuir. Aqui estão outras formas valiosas de ajudar:",
    "text13": "Espalhe a palavra",
    "text14": "Compartilhe nossa plataforma com sua rede e nos ajude a alcançar mais desenvolvedores.",
    "text15": "Impacto na comunidade",
    "text16": "Contribua com código",
    "text17": "Ajude a melhorar nossa plataforma contribuindo com nosso código open source.",
    "text18": "Ver repositório",
    "text19": "Contribuição técnica",
    "text20": "Forneça feedback",
    "text21": "Compartilhe suas ideias e sugestões para tornar a plataforma ainda melhor.",
    "text22": "Enviar feedback",
    "text23": "Percepções dos usuários",
    "text24": "Pronto para apoiar nossa missão?",
    "text25": "Toda contribuição, por menor que seja, nos ajuda a continuar nosso trabalho para tornar o open source mais acessível a todos.",
    "text26": "Me pague um café"
  },
  "team": {
    "text1": "Termos de Serviço",
    "text2": "Última atualização: 29 de Março, 2025",
    "text3": "1. Aceitação dos Termos",
    "text4": "Ao acessar ou usar o Open Source Radar ('plataforma'), você concorda com estes Termos de Serviço. Se você não concordar com algum aspecto destes termos, não utilize nossos serviços.",
    "text5": "2. Descrição do Serviço",
    "text6": "O Open Source Radar é uma plataforma que ajuda desenvolvedores a encontrar projetos open source relevantes para contribuir, com base em suas habilidades e interesses.",
    "text7": "3. Conta do Usuário",
    "text8": "Para utilizar nossos serviços, você precisa fazer login com sua conta do GitHub. Você é responsável por manter a confidencialidade de sua conta e por todas as atividades que ocorrem nela.",
    "text9": "4. Uso Aceitável",
    "text10": "Você concorda em usar nossa plataforma apenas para fins legais e de acordo com estes Termos. Você não deve:",
    "text11": "Violar leis ou regulamentos aplicáveis",
    "text12": "Interferir no funcionamento da plataforma",
    "text13": "Tentar acessar áreas restritas sem autorização",
    "text14": "Utilizar a plataforma para distribuir conteúdo malicioso",
    "text15": "5. Propriedade Intelectual",
    "text16": "Todo o conteúdo e funcionalidades disponíveis na plataforma são propriedade do Open Source Radar ou de seus licenciadores e são protegidos por leis de propriedade intelectual.",
    "text17": "6. Isenção de Garantias",
    "text18": "A plataforma é fornecida 'como está', sem garantias de qualquer tipo, expressas ou implícitas. Não garantimos que a plataforma será ininterrupta, segura ou livre de erros.",
    "text19": "7. Limitação de Responsabilidade",
    "text20": "Em nenhuma circunstância seremos responsáveis por danos diretos, indiretos, incidentais, especiais ou consequentes resultantes do uso ou da incapacidade de usar nossa plataforma.",
    "text21": "8. Modificações dos Termos",
    "text22": "Reservamo-nos o direito de modificar estes Termos a qualquer momento. As alterações entrarão em vigor imediatamente após sua publicação. O uso contínuo da plataforma constitui aceitação dos novos Termos.",
    "text23": "9. Lei Aplicável",
    "text24": "Estes Termos são regidos e interpretados de acordo com as leis do Brasil, independentemente de seus princípios de conflito de leis."
  }
}